// Задача 33. Задайте массив. Напишите программу, которая определяет, присутствует ли заданное число в массиве.
// 4; массив [6, 7, 19, 345, 3] -> Нет
// 3; массив [6, 7, 19, 345, 3] -> да


int[] CreateArrayRndInt(int size, int min, int max)
{
    int[] arr = new int[5];
    Random rnd = new Random();
    for (int i = 0; i < size; i++)
    {
        arr[i] = rnd.Next(min, max + 1);
    }
    return arr;
}

bool FindNumber(int[] arr, int number)
{
    for (int i = 0; i < arr.Length; i++)
    {
        if (arr[i] == number) return true;
    }
    return false;
}

void PrintArray(int[] arr)
{
    for (int i = 0; i < arr.Length; i++)
    {
        Console.Write(arr[i] + " ");
    }
}

int[] array = CreateArrayRndInt(5, -10, 10);

Console.Write("[");
PrintArray(array);
Console.WriteLine("]");

Console.WriteLine("Введите искомое число:");
int num = Convert.ToInt32(Console.ReadLine());

bool findNumber = FindNumber(array, num);
Console.WriteLine(findNumber ? "Искомое число найдено" : "Искомое число не найдено");